app/views/flights/index.html.erb

SELECT "airports".* FROM "airports" ORDER BY "airports"."city" ASC
---
            <%= f.label :departing_airport, "From", class: "block" %>
            <%= f.select :departing_airport, options_for_select(@airport.map { |airport| airport.city }), class: "block" %>