app/controllers/flights_controller.rb

SELECT "flights".* FROM "flights" ORDER BY "flights"."id" ASC LIMIT 1 OFFSET 1
SELECT DISTINCT "flights"."date" FROM "flights" ORDER BY "flights"."date" ASC
---
  def index
    @flights = Flight.all
    @date = Flight.select(:date).distinct.order(:date)

SELECT "airports".* FROM "airports"
---
  def new
    @flight = Flight.new
    @arrival_options = Airport.all.map { |a| [a.city, a.id] }