app/controllers/flights_controller.rb

  def index
    @date = Flight.select(:date).distinct.order(:date)
    @airport = Airport.all
---
SELECT "airports".* FROM "airports"